---
kind: type
id: T:Autodesk.Revit.DB.ExportLineweightKey
source: html/5b3250ab-f70b-6f87-afbf-dd049a64c29e.htm
---
# Autodesk.Revit.DB.ExportLineweightKey

A key used to represent an item stored in an ExportLineweightTable .

## Syntax (C#)
```csharp
public class ExportLineweightKey : IDisposable
```